
#+Title: My Emacs configuration 
#+Property: header-args :tangle init.el 
#+auto_tangle: t
#+startup: overview 
** Dashboard
#+begin_src elisp
  (use-package dashboard
    :demand
    :config
    (dashboard-setup-startup-hook)
    (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))
          dashboard-banner-logo-title "Welcome to Emacs"
          dashboard-startup-banner (concat (file-name-directory user-init-file) "marivector.png")

          dashboard-center-content t)

    ;; Sets which dashboard items should show
    (setq dashboard-banner-logo-title ""
          dashboard-set-footer nil
          dashboard-projects-switch-function 'counsel-projectile-switch-project
          dashboard-items '()
          dashboard-set-navigator t)

    (setq dashboard-navigator-buttons
          `(
            ;; First row
            ((nil
              "Edit emacs config"
              "Open the config file for emacs"
              (lambda (&rest _) (find-file "~/dotfiles/home/dev/emacs/old/README.org")
                )
              'default)
             (nil
              "Open Notes"
              "Open my notes"
              (lambda (&rest _) (org-roam-node-find))
              'default)
             )

            ;; Second row
            ((nil
              "Todo list"
              "Open todo list"
              (lambda (&rest _) (find-file "~/org/Todos.org"))
              'default)
             ))))

  ;; (setq dashboard-set-file-icons t)
  ;; (setq dashboard-set-heading-icons t)
  ;; (setq dashboard-display-icons-p t
  ;;       dashboard-icon-type 'all-the-icons)
  ;; (setq dashboard-heading-icons '((recents   . "history")
  ;;                                 (bookmarks . "bookmark")
  ;;                                 (agenda    . "calendar")
  ;;                                 (projects  . "rocket")
  ;;                                 (registers . "database"))))
#+end_src

#+RESULTS:
: [nil 26278 56495 432856 nil elpaca-process-queues nil nil 0 nil]

**** JS settings
#+begin_src elisp
  (setq org-babel-default-header-args:js
               '((:exports . "both") (:results . "output")))
#+end_src

#+RESULTS:
: ((:exports . both) (:results . output))

** Mini buffer completion 
#+begin_src elisp
  (use-package counsel
    :commands (counsel-M-x
               counsel-find-file
               counsel-describe-variable
               counsel-load-theme)
    :config (setq ivy-use-virtual-buffers t
                  ivy-count-format "(%d/%d) ")
    :bind
    ("M-x" . counsel-M-x)
    ("C-x C-f" . counsel-find-file)
    ("C-h v" . counsel-describe-variable)
    ("C-h f" . counsel-describe-function)
    ("C-c t" . counsel-load-theme)
    )
#+end_src

#+RESULTS:
: [nil 26454 56870 713420 nil elpaca-process-queues nil nil 164000 nil]

** Lsp-mode
#+begin_src elisp
  (use-package lsp-mode
    :hook (prog-mode . lsp-deferred)
    (lsp-mode . lsp-enable-which-key-integration)
    :config
    (setq lsp-inlay-hint-enable t
          lsp-enable-folding t
          lsp-enable-snippet t))

  (use-package lsp-ui :commands lsp-ui-mode)

  (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

  (use-package lsp-java
    :config
    (add-hook 'java-mode-hook 'lsp)
    (setq lsp-java-server-install-dir (getenv "JDTLS_PATH"))
    (defun lsp-java--ls-command ()
      (list "jdtls"
          "-configuration" (concat (getenv "HOME") "/.cache/jdtls/")
          "-data" (concat (getenv "HOME") "/.jdtls"))
    ))

  (use-package lsp-pyright
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            (lsp-deferred))))  ; or lsp-deferred
#+end_src

#+RESULTS:
| (lambda nil (require 'lsp-pyright) (lsp-deferred)) | doom-modeline-env-setup-python | evil-collection-python-set-evil-shift-width |

#+begin_src elisp :tangle no
  (use-package eglot
    :hook (prog-mode . eglot-ensure))
#+end_src
** Company mode
#+begin_src elisp
  (use-package company
    :config
    (global-set-key (kbd "C-c y") 'company-yasnippet)
    :init
    (setq company-auto-commit nil
        company-minimum-prefix-length 2
        company-tooltip-limit 14
        company-tooltip-align-annotations t
        company-require-match 'never
        company-frontends '(company-pseudo-tooltip-frontend
                            company-echo-metadata-frontend)
        )
    (global-company-mode))

  (use-package company-box
    :config
    (setq company-box-show-single-candidate t
        company-box-backends-colors nil)
    :hook (company-mode . company-box-mode))

#+end_src

#+RESULTS:
: [nil 26278 58791 792446 nil elpaca-process-queues nil nil 0 nil]

